---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArrayIterator.#ctor
source: html/9a332bb3-ed19-dfc4-b5ed-5be8d4820da0.htm
---
# Autodesk.Revit.DB.VertexIndexPairArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public VertexIndexPairArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.